#include <stdio.h>

int i = 0, v = 0, x = 0, l = 0, c = 0;

int main(){
    int d, n, y;
    scanf("%d", &d);
    for(y = 1; y <= d; y++){
        n = y;
        //หลักร้อย
        if(n >= 100){
            while(n >= 100){
                n -= 100;
                c++;
            }
        }

        //เป็น 4 หรือ 9
        if(n % 10 == 9){
            n -= 9;
            i++;
            x++;
        }
        if(n / 10 == 9){
            n -= 90;
            c++;
            x++;
        }
        if(n % 10 == 4){
            n -= 4;
            v++;
            i++;
        }
        if(n / 10 == 4){
            n -= 40;
            l++;
            x++;
        }

        //สำหรับ 50
        if(n >= 50){
            n -= 50;
            l++;
        }

        //สำหรับ 10
        if(n >= 10){
            while(n >= 10){
                n -= 10;
                x++;
            }
        }

        //สำหรับ 5
        if(n >= 5){
            n -= 5;
            v++;
        }

        //ทีเหลือ
        i += n;
    }

    printf("%d %d %d %d %d", i, v, x, l, c);
}
